core/src/org/openspcoop2/message/soap/reader/test/requestSoapPrefixEmpty_soap12.xml

<?xml version="1.0" encoding="UTF-8"?>

   <Envelope xmlns="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://services.samples/xsd">
    
    
    <!-- TEST -->
    
<Body>
    <!-- TEST -->
<xsd:skcotSyub>
<redro><lobmys>IBM</lobmys><DIreyub>asankha</DIreyub><ecirp>140.34</ecirp><emulov>2000</emulov></redro>
<redro><lobmys>MSFT</lobmys><DIreyub>ruwan</DIreyub><ecirp>23.56</ecirp><emulov>8030</emulov></redro>
<redro><lobmys>SUN</lobmys><DIreyub>indika</DIreyub><ecirp>14.56</ecirp><emulov>500</emulov></redro>
<redro><lobmys>GOOG</lobmys><DIreyub>chathura</DIreyub><ecirp>60.24</ecirp><emulov>40000</emulov></redro>
<redro><lobmys>IBM</lobmys><DIreyub>asankha</DIreyub><ecirp>140.34</ecirp><emulov>2000</emulov></redro>
<redro><lobmys>MSFT</lobmys><DIreyub>ruwan</DIreyub><ecirp>23.56</ecirp><emulov>8030</emulov></redro>
<redro><lobmys>SUN</lobmys><DIreyub>indika</DIreyub><ecirp>14.56</ecirp><emulov>500</emulov></redro>
<redro><lobmys>GOOG</lobmys><DIreyub>chathura</DIreyub><ecirp>60.24</ecirp><emulov>40000</emulov></redro>
<redro><lobmys>IBM</lobmys><DIreyub>asankha</DIreyub><ecirp>140.34</ecirp><emulov>2000</emulov></redro>
</xsd:skcotSyub>
</Body>
</Envelope>
